{"backend": "tensorflow", "config": {"layers": [{"config": {"name": "dense_1", "units": 512, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0010000000474974513}, "class_name": "L1L2"}, "activation": "relu", "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "bias_constraint": null, "dtype": "float32", "batch_input_shape": [null, 4096], "kernel_initializer": {"config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "class_name": "RandomUniform"}, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"noise_shape": null, "seed": null, "trainable": true, "name": "dropout_1", "rate": 0.6}, "class_name": "Dropout"}, {"config": {"name": "dense_2", "units": 32, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0010000000474974513}, "class_name": "L1L2"}, "activation": "relu", "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "class_name": "RandomUniform"}, "trainable": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"noise_shape": null, "seed": null, "trainable": true, "name": "dropout_2", "rate": 0.6}, "class_name": "Dropout"}, {"config": {"name": "dense_3", "units": 1, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0010000000474974513}, "class_name": "L1L2"}, "activation": "sigmoid", "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "class_name": "RandomUniform"}, "trainable": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}], "name": "sequential_1"}, "keras_version": "2.2.4", "class_name": "Sequential"}