{"class_name": "Sequential", "config": {"layers": [{"class_name": "Dense", "config": {"trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "units": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "kernel_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "bias_regularizer": null, "activity_regularizer": null, "dtype": "float32", "bias_constraint": null, "batch_input_shape": [null, 4096], "use_bias": true, "name": "dense_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "noise_shape": null, "seed": null, "rate": 0.6}}, {"class_name": "Dense", "config": {"trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "units": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "use_bias": true, "name": "dense_2"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "noise_shape": null, "seed": null, "rate": 0.6}}, {"class_name": "Dense", "config": {"trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "units": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "sigmoid", "kernel_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "use_bias": true, "name": "dense_3"}}], "name": "sequential_1"}, "backend": "tensorflow", "keras_version": "2.2.4"}