{"class_name": "Sequential", "backend": "tensorflow", "config": {"name": "sequential_1", "layers": [{"class_name": "Dense", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 4096], "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "normal"}}, "trainable": true, "bias_regularizer": null, "activation": "relu", "units": 512, "use_bias": true, "dtype": "float32", "kernel_constraint": null, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "noise_shape": null, "name": "dropout_1", "rate": 0.6, "seed": null}}, {"class_name": "Dense", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "dense_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "normal"}}, "trainable": true, "activation": "linear", "units": 32, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "noise_shape": null, "name": "dropout_2", "rate": 0.6, "seed": null}}, {"class_name": "Dense", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "dense_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "normal"}}, "trainable": true, "activation": "sigmoid", "units": 1, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null}}]}, "keras_version": "2.2.4"}