{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.4", "config": {"layers": [{"class_name": "Dense", "config": {"bias_regularizer": null, "use_bias": true, "trainable": true, "units": 512, "bias_constraint": null, "dtype": "float32", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "batch_input_shape": [null, 4096], "activity_regularizer": null, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "normal"}}, "kernel_constraint": null}}, {"class_name": "Dropout", "config": {"seed": null, "rate": 0.6, "trainable": true, "name": "dropout_1", "noise_shape": null}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "use_bias": true, "trainable": true, "units": 32, "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "activity_regularizer": null, "name": "dense_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "normal"}}}}, {"class_name": "Dropout", "config": {"seed": null, "rate": 0.6, "trainable": true, "name": "dropout_2", "noise_shape": null}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "use_bias": true, "trainable": true, "units": 1, "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "sigmoid", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "activity_regularizer": null, "name": "dense_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "normal"}}}}], "name": "sequential_1"}}