{"class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "Dense", "config": {"dtype": "float32", "bias_regularizer": null, "use_bias": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "units": 512, "name": "dense_1", "activation": "relu", "trainable": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "batch_input_shape": [null, 4096], "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "rate": 0.6, "seed": null, "trainable": true, "noise_shape": null}}, {"class_name": "Dense", "config": {"use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "units": 32, "name": "dense_2", "activation": "relu", "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "rate": 0.6, "seed": null, "trainable": true, "noise_shape": null}}, {"class_name": "Dense", "config": {"use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "units": 1, "name": "dense_3", "activation": "sigmoid", "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null}}]}, "backend": "tensorflow", "keras_version": "2.2.4"}